results/task#5/wrk_put.txt
 wrk  -t4 -c200 -d30s -sput.lua -R2000 --latency http://localhost:8080
Running 30s test @ http://localhost:8080
  4 threads and 200 connections
  Thread calibration: mean lat.: 5.117ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 2.409ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.259ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.234ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.30ms    2.09ms  33.22ms   89.24%
    Req/Sec   525.50    394.69     2.38k    80.32%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.70ms
 75.000%    2.68ms
 90.000%    4.54ms
 99.000%   10.62ms
 99.900%   20.88ms
 99.990%   31.71ms
 99.999%   33.25ms
100.000%   33.25ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.221     0.000000            1         1.00
       0.767     0.100000         3957         1.11
       1.027     0.200000         7907         1.25
       1.253     0.300000        11844         1.43
       1.467     0.400000        15786         1.67
       1.703     0.500000        19721         2.00
       1.831     0.550000        21694         2.22
       1.980     0.600000        23670         2.50
       2.155     0.650000        25655         2.86
       2.381     0.700000        27614         3.33
       2.683     0.750000        29589         4.00
       2.877     0.775000        30575         4.44
       3.119     0.800000        31562         5.00
       3.373     0.825000        32549         5.71
       3.695     0.850000        33527         6.67
       4.087     0.875000        34512         8.00
       4.303     0.887500        35008         8.89
       4.543     0.900000        35503        10.00
       4.831     0.912500        35991        11.43
       5.123     0.925000        36490        13.33
       5.475     0.937500        36981        16.00
       5.675     0.943750        37225        17.78
       5.891     0.950000        37470        20.00
       6.123     0.956250        37720        22.86
       6.443     0.962500        37964        26.67
       6.887     0.968750        38212        32.00
       7.139     0.971875        38336        35.56
       7.427     0.975000        38456        40.00
       7.807     0.978125        38581        45.71
       8.287     0.981250        38703        53.33
       8.903     0.984375        38827        64.00
       9.311     0.985938        38890        71.11
       9.711     0.987500        38951        80.00
      10.215     0.989062        39011        91.43
      10.895     0.990625        39073       106.67
      11.519     0.992188        39134       128.00
      11.823     0.992969        39165       142.22
      12.351     0.993750        39196       160.00
      12.975     0.994531        39227       182.86
      13.719     0.995313        39259       213.33
      14.575     0.996094        39288       256.00
      15.103     0.996484        39304       284.44
      15.775     0.996875        39319       320.00
      16.559     0.997266        39335       365.71
      17.311     0.997656        39350       426.67
      18.143     0.998047        39365       512.00
      18.575     0.998242        39373       568.89
      19.023     0.998437        39381       640.00
      19.567     0.998633        39389       731.43
      20.079     0.998828        39396       853.33
      21.231     0.999023        39404      1024.00
      21.695     0.999121        39408      1137.78
      23.103     0.999219        39412      1280.00
      23.487     0.999316        39416      1462.86
      24.415     0.999414        39419      1706.67
      25.983     0.999512        39423      2048.00
      26.255     0.999561        39425      2275.56
      26.719     0.999609        39427      2560.00
      27.055     0.999658        39429      2925.71
      27.503     0.999707        39431      3413.33
      27.743     0.999756        39433      4096.00
      27.759     0.999780        39434      4551.11
      27.823     0.999805        39435      5120.00
      28.063     0.999829        39436      5851.43
      29.935     0.999854        39437      6826.67
      31.711     0.999878        39438      8192.00
      31.711     0.999890        39438      9102.22
      32.287     0.999902        39439     10240.00
      32.287     0.999915        39439     11702.86
      32.415     0.999927        39440     13653.33
      32.415     0.999939        39440     16384.00
      32.415     0.999945        39440     18204.44
      32.639     0.999951        39441     20480.00
      32.639     0.999957        39441     23405.71
      32.639     0.999963        39441     27306.67
      32.639     0.999969        39441     32768.00
      32.639     0.999973        39441     36408.89
      33.247     0.999976        39442     40960.00
      33.247     1.000000        39442          inf
#[Mean    =        2.302, StdDeviation   =        2.086]
#[Max     =       33.216, Total count    =        39442]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59360 requests in 30.00s, 3.79MB read
Requests/sec:   1978.81
Transfer/sec:    129.47KB